CarRentWebApp/CarRentWebApp/Service References/GetBookedServiceReference/GetBookedRentsWSDL.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns="http://rentcar.hub.com/" xmlns:tns="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetBookedRentsWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" name="GetBookedRentsWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetBookedRentsWSDL" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <plnk:partnerLinkType name="GetBookedRentsWSDL">
    <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
    <plnk:role name="GetBookedRentsWSDLPortTypeRole" portType="tns:GetBookedRentsWSDLPortType" />
  </plnk:partnerLinkType>
  <wsdl:types>
    <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetBookedRentsWSDL">
      <xsd:import schemaLocation="http://Office-Depot:9080/CarRentalCA-sun-http-binding/CarRentalBPEL/file:/C:/Users/Irving/Documents/Git/TopicosWeb/CarRentalBPEL/retrieved/src/localhost_8080/HubService/HubService.xsd_1.xsd" namespace="http://rentcar.hub.com/" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="GetBookedRentsWSDLOperationRequest">
    <wsdl:part name="inputBookedRents" type="xsd:string" />
  </wsdl:message>
  <wsdl:message name="GetBookedRentsWSDLOperationResponse">
    <wsdl:part name="bookedResponses" element="ns:getRegistryResponse" />
  </wsdl:message>
  <wsdl:portType name="GetBookedRentsWSDLPortType">
    <wsdl:operation name="GetBookedRentsWSDLOperation">
      <wsdl:input name="input1" message="tns:GetBookedRentsWSDLOperationRequest" />
      <wsdl:output name="output1" message="tns:GetBookedRentsWSDLOperationResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="GetBookedRentsWSDLBinding" type="tns:GetBookedRentsWSDLPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
    <wsdl:operation name="GetBookedRentsWSDLOperation">
      <soap:operation soapAction="" />
      <wsdl:input name="input1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetBookedRentsWSDL" />
      </wsdl:input>
      <wsdl:output name="output1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetBookedRentsWSDL" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="GetBookedRentsWSDLService">
    <wsdl:port name="GetBookedRentsWSDLPort" binding="tns:GetBookedRentsWSDLBinding">
      <soap:address location="http://Office-Depot:9080/GetBookedRentsWSDLService/GetBookedRentsWSDLPort" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>