CarRentalCA/test/GetBookedRentsTestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:get="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/GetBookedRentsWSDL">
  <soapenv:Body>
    <get:GetBookedRentsWSDLOperation>
      <inputBookedRents></inputBookedRents>
    </get:GetBookedRentsWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>